tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "k1low/tap"
brew "awscli"
brew "bat"
brew "glib"
brew "curl"
brew "php"
brew "composer"
brew "coreutils"
brew "erlang"
brew "elixir"
brew "envchain"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "ghq"
brew "git"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "haskell-stack"
brew "shared-mime-info"
brew "imagemagick"
brew "jq"
brew "kubectx"
brew "libxml2"
brew "mas"
brew "memcached"
brew "mkcert"
brew "mysql"
brew "nghttp2"
brew "nkf"
brew "node"
brew "nodebrew"
brew "peco"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql@14"
brew "pssh"
brew "python@3.8"
brew "python@3.9"
brew "ripgrep"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "rustup-init"
brew "stern"
brew "telnet"
brew "tfenv"
brew "tree"
brew "v8"
brew "volta"
brew "wget"
brew "yarn"
brew "heroku/brew/heroku"
brew "k1low/tap/tbls"
cask "1password"
cask "1password-cli"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "obsidian"
cask "slack"
cask "visual-studio-code"
