tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "k1low/tap"
tap "songmu/tap"
brew "actionlint"
brew "awscli"
brew "bat"
brew "byobu"
brew "composer"
brew "coreutils"
brew "curl"
brew "deno"
brew "diffutils"
brew "direnv"
brew "elixir"
brew "envchain"
brew "erlang"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "ghq"
brew "git"
brew "glib"
brew "glow"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "haskell-stack"
brew "imagemagick"
brew "jq"
brew "kubectx"
brew "libxml2"
brew "libyaml"
brew "lima"
brew "mas"
brew "memcached"
brew "mise"
brew "mkcert"
brew "mysql"
brew "nghttp2"
brew "nkf"
brew "node"
brew "nodebrew"
brew "openjdk"
brew "peco"
brew "php"
brew "pinentry-mac"
brew "pipenv"
brew "postgresql@17", restart_service: true
brew "pssh"
brew "python@3.8"
brew "python@3.9"
brew "rbenv"
brew "redis"
brew "rgbds"
brew "ripgrep"
brew "ruby-build"
brew "rustup"
brew "sdl2"
brew "shared-mime-info"
brew "sqlcmd"
brew "stern"
brew "telnet"
brew "tfenv"
brew "tree"
brew "v8"
brew "volta"
brew "wget"
brew "yarn"
brew "heroku/brew/heroku"
brew "k1low/tap/tbls"
brew "songmu/tap/blogsync"
