tap "heroku/brew"

brew "actionlint"
brew "awscli"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "gh"
brew "glib"
brew "gnu-sed"
brew "gnupg"
brew "jq"
brew "libxml2"
brew "libyaml"
brew "lima"
brew "mas"
brew "nkf"
brew "peco"
brew "pinentry-mac"
brew "redis"
brew "rustup"
brew "shared-mime-info"
brew "tbls"
brew "tfenv"
brew "tree"
brew "v8"
brew "wget"
brew "yarn"
brew "heroku/brew/heroku"

cask_args adopt: true
cask "1password-cli"
cask "1password"
cask "firefox"
cask "gcloud-cli"
cask "google-chrome"
cask "slack"
cask "visual-studio-code"

mas "1Password for Safari", id: 1569813296
mas "CotEditor", id: 1024640650
